# Делала Диана Волощук из ИС-25
# Задание 1
a = int(input("a:"))
b = int(input("b:"))
result = (a > 0) or (b < -2)
print(result)
