# Делала Диана Волощук из ИС-25
# Задание 1
a = int(input("Введите целое число a:"))
b = int(input("Введите целое число b:"))
result = (a > 0) or (b < -2) #Проверка
print(result)

# Задание 2
a = int(input("Введите трехзначное число")) #Ввод трехзначного числа
suit
